backend/app/jobs/get_summoners_and_ranks_job.rb

INSERT INTO "summoners" ("puuid", "name", "tag", "summoner_level", "profile_icon_id", "revision_date", "region", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
SELECT "summoners".* FROM "summoners" WHERE "summoners"."puuid" = $1 LIMIT $2  [["puuid", "_EdeAIyc7N3YJ2-E7GqRPcsy2ihkZ6clY4RdlrqNlB8Mc1z1gEWbMiehYDRZO9Tq3TBacGHFvYxu0w"], ["LIMIT", 1]]
UPDATE "summoners" SET "revision_date" = $1, "updated_at" = $2 WHERE "summoners"."id" = $3  [["revision_date", 1755482221037], ["updated_at", "2025-08-18 02:06:14.113766"], ["id", "1c849711-ddea-4345-8bed-6d3affb402a8"]]
INSERT INTO "ranks" ("summoner_id", "queue_type", "tier", "division", "league_points", "wins", "losses", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
SELECT "ranks".* FROM "ranks" WHERE "ranks"."summoner_id" = $1 AND "ranks"."queue_type" = $2 LIMIT $3  [["summoner_id", "6ef2b95b-f862-4609-b85a-6cff64b5b085"], ["queue_type", "RANKED_SOLO_5x5"], ["LIMIT", 1]]
UPDATE "ranks" SET "tier" = $1, "division" = $2, "league_points" = $3, "wins" = $4, "losses" = $5, "updated_at" = $6 WHERE "ranks"."id" = $7  [["tier", "BRONZE"], ["division", "II"], ["league_points", 65], ["wins", 19], ["losses", 28], ["updated_at", "2025-08-18 01:44:15.569469"], ["id", "6e7ef608-ccc5-4709-b144-558c63cbcb1e"]]
---
  def perform
    Rank.queue_types.each_value do |queue_type|
      REGION_MAP.each do |small_region, big_region|
        Rank.tiers.each_value do |tier|
          Rank.divisions.each_value do |division|

            league_data = Riot::RiotApiService.new(
              region: small_region, #small region
              path: "league-exp/v4/entries/#{queue_type}/#{tier}/#{division}"
            ).run!

            league_data.first(1).each do |league_dto|
              puuid = league_dto[:puuid]

              summoner_data = Riot::RiotApiService.new(
                region: small_region, #small region
                path: "summoner/v4/summoners/by-puuid/#{puuid}"
              ).run!

              account_data = Riot::RiotApiService.new(
                account_region: big_region,
                path: "account/v1/accounts/by-puuid/#{puuid}"
              ).run!

              summoner = Summoner.find_or_create_by(puuid: puuid)
              summoner.update(
                name: account_data[:gameName],
                tag: account_data[:tagLine],
                summoner_level: summoner_data[:summonerLevel],
                profile_icon_id: summoner_data[:profileIconId],
                revision_date: summoner_data[:revisionDate],
                region: small_region
              )

              rank = summoner.ranks.find_or_create_by(queue_type: league_dto[:queueType])
              rank.update(
                tier: league_dto[:tier],
                division: league_dto[:rank],
                league_points: league_dto[:leaguePoints],
                wins: league_dto[:wins],
                losses: league_dto[:losses]
              )