app/services/account/account_login_service.rb

SELECT "accounts".* FROM "accounts" WHERE "accounts"."username" = $1 LIMIT $2  [["username", "Ginjyyy"], ["LIMIT", 1]]
---
  def login
    account = Account.find_by(username: @params[:username])