app/services/account/account_signup_service.rb

  def create_account
    account = Account.create!(
      username: @params[:username],
      password: @params[:password],
      status: 'active'
    )
---
INSERT INTO "accounts" ("username", "status", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "Ginjyyy"], ["status", "active"], ["created_at", "2025-08-14 05:58:55.268184"], ["updated_at", "2025-08-14 05:58:55.268184"], ["password_digest", "[FILTERED]"]]