app/jobs/get_match_data_job.rb

  def perform

    Summoner.find_each do |summoner|

      match_region = RiotRegionConcern::MATCH_REGION_MAP[summoner.region]
      #encoded_puuid = ERB::Util.url_encode(summoner.puuid)

      matches = Riot::RiotApiService.new(
        match_region: match_region,
        path: "match/v5/matches/by-puuid/#{summoner.puuid}/ids"
      ).run!

      matches.first(5).each do |riot_match_id|

        match_data = Riot::RiotApiService.new(
          match_region: match_region,
          path: "match/v5/matches/#{riot_match_id}"
        ).run!

        metadata = match_data[:metadata]
        info = match_data[:info]

        match = Match.find_or_create_by!(riot_match_id: metadata[:matchId]) do |m|
---
SELECT "summoners".* FROM "summoners" ORDER BY "summoners"."id" ASC LIMIT $1  [["LIMIT", 1000]]
INSERT INTO "matches" ("riot_match_id", "region", "game_version", "game_mode", "game_duration", "queue_id", "map", "winning_team_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
SELECT "matches".* FROM "matches" WHERE "matches"."riot_match_id" = $1 LIMIT $2  [["riot_match_id", "LA2_1514963176"], ["LIMIT", 1]]